schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-20 Mon 16:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Schedule</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Schedule</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org51a7cd4">Week 1: Basics</a></li>
<li><a href="#org4333529">Week 2: Ownership</a></li>
<li><a href="#org3646c9d">Week 3: Data</a></li>
<li><a href="#orgcb8e975">Week 4: Functions</a></li>
<li><a href="#org700db27">Week 5: Lifetimes</a></li>
<li><a href="#org05d884a">Week 6: Smart Pointers</a></li>
<li><a href="#orgc52c9f6">Week 7</a></li>
<li><a href="#org7172e26">Week 8: SPRING RECESS</a></li>
<li><a href="#org8d26e82">Week 9: Theory</a></li>
<li><a href="#org026dadf">Week 10: Interpreters</a></li>
<li><a href="#orgd9f837b">Week 11: FR Syntax</a></li>
<li><a href="#orgdbef485">Week 12: FR Semantics</a></li>
<li><a href="#orgea0f3c0">Week 13: FR Borrow Checking</a></li>
<li><a href="#org6225d78">Week 14: FR Extensions</a></li>
<li><a href="#orgf146a66">Week 15: FR Soundness</a></li>
</ul>
</div>
</div>
<div id="outline-container-org51a7cd4" class="outline-2">
<h2 id="org51a7cd4">Week 1: Basics</h2>
<div class="outline-text-2" id="text-org51a7cd4">
</div>
<div id="outline-container-01-21" class="outline-3">
<h3 id="01-21">TUE 01-21 Lecture 1</h3>
<div class="outline-text-3" id="text-01-21">
</div>
<ul class="org-ul">
<li><a id="orgc42eb6b"></a>Title: <b>Course Introduction</b><br /></li>
<li><a id="org2245ff7"></a>Topics:<br />
<div class="outline-text-4" id="text-org2245ff7">
<ul class="org-ul">
<li>Discuss how the course structure, expectations, etc.</li>
<li>Briefly talk about Rust</li>
<li>Install Rust and Cargo</li>
<li>Set up our first Cargo project</li>
</ul>
</div>
</li>
<li><a id="org5d2c76f"></a>Reading:<br />
<div class="outline-text-4" id="text-org5d2c76f">
<ul class="org-ul">
<li>Syllabus</li>
<li>The Rust Programming Language (RPL): <a href="https://doc.rust-lang.org/book/foreword.html">Forward</a></li>
<li>RPL: <a href="https://doc.rust-lang.org/book/ch00-00-introduction.html">Introduction</a></li>
<li>RPL 1: <a href="https://doc.rust-lang.org/book/ch01-00-getting-started.html">Getting Started</a></li>
<li>Course Notes (CN) 1: <a href="notes.html#intro">What is this course?</a></li>
<li>CN 2: <a href="notes.html#set-up">Set up</a></li>
</ul>
</div>
</li>
<li><a id="org5e48b03"></a>Discussion Questions:<br />
<div class="outline-text-4" id="text-org5e48b03">
<ul class="org-ul">
<li>Why are you taking this course?  What do you want to get out of it?</li>
<li>Have you heard of Rust before this course?</li>
<li>Do you like using a low-level programming language like C?</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-01-23" class="outline-3">
<h3 id="01-23">THU 01-23 Lecture 2</h3>
<div class="outline-text-3" id="text-01-23">
</div>
<ul class="org-ul">
<li><a id="org3e02609"></a>Title: <b>Basic Programming</b><br /></li>
<li><a id="org415052e"></a>Topics:<br />
<div class="outline-text-4" id="text-org415052e">
<ul class="org-ul">
<li>Reminder ourselves how to read BNF grammars</li>
<li>Do some "normal" programming with Rust</li>
<li>Look more carefully at the grammar of Rust</li>
</ul>
</div>
</li>
<li><a id="orgd666a79"></a>Reading:<br />
<div class="outline-text-4" id="text-orgd666a79">
<ul class="org-ul">
<li>RPL 2: <a href="https://doc.rust-lang.org/book/ch02-00-guessing-game-tutorial.html">Programming a Guessing Game</a></li>
<li>RPL 3: <a href="https://doc.rust-lang.org/book/ch03-00-common-programming-concepts.html">Common Programming Concepts</a></li>
<li>PL@BU 2: <a href="https://nmmull.github.io/PL-at-BU/Formal-Grammar/notes.html">Formal Grammar</a></li>
</ul>
</div>
</li>
<li><a id="org99eac7f"></a>Discussion Questions:<br />
<div class="outline-text-4" id="text-org99eac7f">
<ul class="org-ul">
<li>How well does Python or C++ programming transfer to basic Rust
programming?  Do you feel you could write any program on integers in
Rust that you could already write in Python?  Why or why not?</li>
<li>One somewhat strange feature of Rust's parser is that it allows
trailing commas.  Why do you think this is?</li>
<li>Are there features you wish Rust had?  Are there features it has
(that we've seen so far) that you don't like?</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4333529" class="outline-2">
<h2 id="org4333529">Week 2: Ownership</h2>
<div class="outline-text-2" id="text-org4333529">
</div>
<div id="outline-container-01-28" class="outline-3">
<h3 id="01-28">TUE 01-28 Lecture 3</h3>
<div class="outline-text-3" id="text-01-28">
</div>
<ul class="org-ul">
<li><a id="orgb3e8a28"></a>Title: <b>The Stack and Heap</b><br /></li>
<li><a id="org5c6cb63"></a>Topics:<br /></li>
<li><a id="org6b85bb9"></a>Reading:<br />
<div class="outline-text-4" id="text-org6b85bb9">
<ul class="org-ul">
<li>RPL 4.1: <a href="https://doc.rust-lang.org/book/ch04-01-what-is-ownership.html">What is Ownership?</a></li>
</ul>
</div>
</li>
<li><a id="org1adaa86"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-01-30" class="outline-3">
<h3 id="01-30">THU 01-30 Lecture 4</h3>
<div class="outline-text-3" id="text-01-30">
</div>
<ul class="org-ul">
<li><a id="orgaea8c0a"></a>Title: <b>References and Borrowing</b><br /></li>
<li><a id="org3cc69d7"></a>Topics:<br /></li>
<li><a id="orgd97e984"></a>Reading:<br />
<div class="outline-text-4" id="text-orgd97e984">
<ul class="org-ul">
<li>RPL 4.2: <a href="https://doc.rust-lang.org/book/ch04-02-references-and-borrowing.html">References and Borrowing</a></li>
</ul>
</div>
</li>
<li><a id="org42152f8"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3646c9d" class="outline-2">
<h2 id="org3646c9d">Week 3: Data</h2>
<div class="outline-text-2" id="text-org3646c9d">
</div>
<div id="outline-container-02-04" class="outline-3">
<h3 id="02-04">TUE 02-04 Lecture 5</h3>
<div class="outline-text-3" id="text-02-04">
</div>
<ul class="org-ul">
<li><a id="orgc9cbb86"></a>Title: <b>Structures and Enumerations</b><br /></li>
<li><a id="org6266607"></a>Topics:<br /></li>
<li><a id="org9f54701"></a>Reading:<br />
<div class="outline-text-4" id="text-org9f54701">
<ul class="org-ul">
<li>RPL 5: <a href="https://doc.rust-lang.org/book/ch05-00-structs.html">Using Structs to Structure Related Data</a></li>
<li>PRL 6: <a href="https://doc.rust-lang.org/book/ch06-00-enums.html">Enums and Pattern Matching</a></li>
<li>RPL 18: <a href="https://doc.rust-lang.org/book/ch18-00-patterns.html">Patterns and Matching</a></li>
</ul>
</div>
</li>
<li><a id="org1b455e2"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-02-06" class="outline-3">
<h3 id="02-06">THU 02-06 Lecture 6</h3>
<div class="outline-text-3" id="text-02-06">
</div>
<ul class="org-ul">
<li><a id="org1498a36"></a>Title: <b>Collections and Slices</b><br /></li>
<li><a id="org9eb5201"></a>Topics:<br /></li>
<li><a id="org2cfcb4a"></a>Reading:<br />
<div class="outline-text-4" id="text-org2cfcb4a">
<ul class="org-ul">
<li>RPL 4.3: <a href="https://doc.rust-lang.org/book/ch04-03-slices.html">The Slice Type</a></li>
<li>RPL 8: <a href="https://doc.rust-lang.org/book/ch08-00-common-collections.html">Common Collections</a></li>
</ul>
</div>
</li>
<li><a id="orgaa16946"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgcb8e975" class="outline-2">
<h2 id="orgcb8e975">Week 4: Functions</h2>
<div class="outline-text-2" id="text-orgcb8e975">
</div>
<div id="outline-container-02-11" class="outline-3">
<h3 id="02-11">TUE 02-11 Lecture 7</h3>
<div class="outline-text-3" id="text-02-11">
</div>
<ul class="org-ul">
<li><a id="org8bef2d9"></a>Title: <b>Generics and Traits</b><br /></li>
<li><a id="org698675a"></a>Topics:<br />
<div class="outline-text-4" id="text-org698675a">
<ul class="org-ul">
<li>RPL 10.1: <a href="https://doc.rust-lang.org/book/ch10-01-syntax.html">Generic Data Types</a></li>
<li>RPL 10.2: <a href="https://doc.rust-lang.org/book/ch10-02-traits.html">Traits: Defining Shared Behavior</a></li>
</ul>
</div>
</li>
<li><a id="org3fa9b35"></a>Reading:<br /></li>
<li><a id="org63780e5"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-02-13" class="outline-3">
<h3 id="02-13">THU 02-13 Lecture 8</h3>
<div class="outline-text-3" id="text-02-13">
</div>
<ul class="org-ul">
<li><a id="orgd431e7c"></a>Title: <b>Closures and Iterators</b><br /></li>
<li><a id="org5f16071"></a>Topics:<br /></li>
<li><a id="orgf07fc7b"></a>Reading:<br />
<div class="outline-text-4" id="text-orgf07fc7b">
<ul class="org-ul">
<li>RPL 13: <a href="https://doc.rust-lang.org/book/ch13-00-functional-features.html">Functional Language Features: Iterators and Closures</a></li>
</ul>
</div>
</li>
<li><a id="org9c167db"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org700db27" class="outline-2">
<h2 id="org700db27">Week 5: Lifetimes</h2>
<div class="outline-text-2" id="text-org700db27">
</div>
<div id="outline-container-02-20" class="outline-3">
<h3 id="02-20">THU 02-20 Lecture 9</h3>
<div class="outline-text-3" id="text-02-20">
</div>
<ul class="org-ul">
<li><a id="org34fd561"></a>Title: <b>Lifetimes</b><br /></li>
<li><a id="org0405b01"></a>Topics:<br /></li>
<li><a id="org98aeed0"></a>Reading:<br />
<div class="outline-text-4" id="text-org98aeed0">
<ul class="org-ul">
<li>RPL 10.3: <a href="https://doc.rust-lang.org/book/ch10-03-lifetime-syntax.html">Validating References with Lifetimes</a></li>
</ul>
</div>
</li>
<li><a id="orgc6064a9"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org05d884a" class="outline-2">
<h2 id="org05d884a">Week 6: Smart Pointers</h2>
<div class="outline-text-2" id="text-org05d884a">
</div>
<div id="outline-container-02-25" class="outline-3">
<h3 id="02-25">TUE 02-25 Lecture 10</h3>
<div class="outline-text-3" id="text-02-25">
</div>
<ul class="org-ul">
<li><a id="org9c38a46"></a>Title: <b>Boxes and Recursive Data</b><br /></li>
<li><a id="orgddef874"></a>Topics:<br /></li>
<li><a id="org1d5ad4e"></a>Reading:<br /></li>
<li><a id="orge8ce2bf"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-02-27" class="outline-3">
<h3 id="02-27">THU 02-27 Lecture 11</h3>
<div class="outline-text-3" id="text-02-27">
</div>
<ul class="org-ul">
<li><a id="org4a26ad0"></a>Title: <b>Reference Counting and Internal Mutability</b><br /></li>
<li><a id="orgb0be11f"></a>Topics:<br /></li>
<li><a id="org65e156f"></a>Reading:<br /></li>
<li><a id="org73761e1"></a>Reminders:<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgc52c9f6" class="outline-2">
<h2 id="orgc52c9f6">Week 7</h2>
<div class="outline-text-2" id="text-orgc52c9f6">
</div>
<div id="outline-container-03-04" class="outline-3">
<h3 id="03-04">TUE 03-04 Lecture 12</h3>
<div class="outline-text-3" id="text-03-04">
</div>
<ul class="org-ul">
<li><a id="org225e679"></a>Title: <b>TBD</b><br /></li>
<li><a id="org56971f3"></a>Topics:<br /></li>
<li><a id="orgec20403"></a>Reading:<br /></li>
<li><a id="orgf6cd1f0"></a>Reminders:<br /></li>
</ul>
</div>

<div id="outline-container-03-06" class="outline-3">
<h3 id="03-06">THU 03-06 Midterm Exam</h3>
<div class="outline-text-3" id="text-03-06">
</div>
</div>
</div>
<div id="outline-container-org7172e26" class="outline-2">
<h2 id="org7172e26">Week 8: SPRING RECESS</h2>
</div>
<div id="outline-container-org8d26e82" class="outline-2">
<h2 id="org8d26e82">Week 9: Theory</h2>
<div class="outline-text-2" id="text-org8d26e82">
</div>
<div id="outline-container-03-18" class="outline-3">
<h3 id="03-18">TUE 03-18 Lecture 13</h3>
<div class="outline-text-3" id="text-03-18">
</div>
<ul class="org-ul">
<li><a id="orgdcb4369"></a>Title: <b>Logic and Type Theory</b><br /></li>
<li><a id="org495b9a4"></a>Topics:<br /></li>
<li><a id="org519a474"></a>Reading:<br /></li>
<li><a id="org252dbd8"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-03-20" class="outline-3">
<h3 id="03-20">THU 03-20 Lecture 14</h3>
<div class="outline-text-3" id="text-03-20">
</div>
<ul class="org-ul">
<li><a id="orgfc1b70f"></a>Title: <b>Linear Types</b><br /></li>
<li><a id="org063a19e"></a>Topics:<br /></li>
<li><a id="orga540534"></a>Reading:<br /></li>
<li><a id="orgdabb98a"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org026dadf" class="outline-2">
<h2 id="org026dadf">Week 10: Interpreters</h2>
<div class="outline-text-2" id="text-org026dadf">
</div>
<div id="outline-container-03-25" class="outline-3">
<h3 id="03-25">TUE 03-25 Lecture 15</h3>
<div class="outline-text-3" id="text-03-25">
</div>
<ul class="org-ul">
<li><a id="orgdaea9fc"></a>Title: <b>Crafting Interpreters</b><br /></li>
<li><a id="org9ab9741"></a>Topics:<br /></li>
<li><a id="orgad927dc"></a>Reading:<br /></li>
<li><a id="org16c2d05"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-03-27" class="outline-3">
<h3 id="03-27">THU 03-27 Lecture 16</h3>
<div class="outline-text-3" id="text-03-27">
</div>
<ul class="org-ul">
<li><a id="org5637311"></a>Title: <b>Workshop: An Interpreter for STLC</b><br /></li>
<li><a id="org060e47f"></a>Topics:<br /></li>
<li><a id="org578e0ce"></a>Reading:<br /></li>
<li><a id="org28fd977"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgd9f837b" class="outline-2">
<h2 id="orgd9f837b">Week 11: FR Syntax</h2>
<div class="outline-text-2" id="text-orgd9f837b">
</div>
<div id="outline-container-04-01" class="outline-3">
<h3 id="04-01">TUE 04-01 Lecture 17</h3>
<div class="outline-text-3" id="text-04-01">
</div>
<ul class="org-ul">
<li><a id="orgc61bbc9"></a>Title: <b>FR Calculus: Introduction</b><br /></li>
<li><a id="org7647324"></a>Topics:<br /></li>
<li><a id="org13ee7d9"></a>Reading:<br /></li>
<li><a id="org1a69b31"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-04-03" class="outline-3">
<h3 id="04-03">THU 04-03 Lecture 18</h3>
<div class="outline-text-3" id="text-04-03">
</div>
<ul class="org-ul">
<li><a id="orgd24a549"></a>Title: <b>FR Calculus: Syntax</b><br /></li>
<li><a id="org4194280"></a>Topics:<br /></li>
<li><a id="orgc721e0e"></a>Reading:<br /></li>
<li><a id="org2a47eed"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgdbef485" class="outline-2">
<h2 id="orgdbef485">Week 12: FR Semantics</h2>
<div class="outline-text-2" id="text-orgdbef485">
</div>
<div id="outline-container-04-08" class="outline-3">
<h3 id="04-08">TUE 04-08 Lecture 19</h3>
<div class="outline-text-3" id="text-04-08">
</div>
<ul class="org-ul">
<li><a id="org521348c"></a>Title: <b>Workshop: A Parser</b><br /></li>
<li><a id="org70adcb5"></a>Topics:<br /></li>
<li><a id="org2a08210"></a>Reading:<br /></li>
<li><a id="org7528c88"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-04-10" class="outline-3">
<h3 id="04-10">THU 04-10 Lecture 20</h3>
<div class="outline-text-3" id="text-04-10">
</div>
<ul class="org-ul">
<li><a id="org900559c"></a>Title: <b>FR Calculus: Semantics</b><br /></li>
<li><a id="org4ef9a31"></a>Topics:<br /></li>
<li><a id="org72f365f"></a>Reading:<br /></li>
<li><a id="orgfa4f0a7"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgea0f3c0" class="outline-2">
<h2 id="orgea0f3c0">Week 13: FR Borrow Checking</h2>
<div class="outline-text-2" id="text-orgea0f3c0">
</div>
<div id="outline-container-04-15" class="outline-3">
<h3 id="04-15">TUE 04-15 Lecture 21</h3>
<div class="outline-text-3" id="text-04-15">
</div>
<ul class="org-ul">
<li><a id="org0c3fb2d"></a>Title: <b>Workshop: An Evaluator</b><br /></li>
<li><a id="org77c8f2d"></a>Topics:<br /></li>
<li><a id="org35f94ae"></a>Reading:<br /></li>
<li><a id="org2583827"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-04-17" class="outline-3">
<h3 id="04-17">THU 04-17 Lecture 22</h3>
<div class="outline-text-3" id="text-04-17">
</div>
<ul class="org-ul">
<li><a id="orgc79bd81"></a>Title: <b>FR Calculus: Type and Borrow Checking</b><br /></li>
<li><a id="orgfcb093b"></a>Topics:<br /></li>
<li><a id="orgd48e224"></a>Reading:<br /></li>
<li><a id="org3c9b7d7"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6225d78" class="outline-2">
<h2 id="org6225d78">Week 14: FR Extensions</h2>
<div class="outline-text-2" id="text-org6225d78">
</div>
<div id="outline-container-04-22" class="outline-3">
<h3 id="04-22">TUE 04-22 Lecture 23</h3>
<div class="outline-text-3" id="text-04-22">
</div>
<ul class="org-ul">
<li><a id="org3cc2b87"></a>Title: <b>Workshop: A Type/Borrow Checker</b><br /></li>
<li><a id="org4c335b5"></a>Topics:<br /></li>
<li><a id="orga89cefd"></a>Reading:<br /></li>
<li><a id="orgc5159a0"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-04-24" class="outline-3">
<h3 id="04-24">THU 04-24 Lecture 24</h3>
<div class="outline-text-3" id="text-04-24">
</div>
<ul class="org-ul">
<li><a id="orgfaab3f4"></a>Title: <b>FR Calculus: Extensions</b><br /></li>
<li><a id="org996fe59"></a>Topics:<br /></li>
<li><a id="org1b2773b"></a>Reading:<br /></li>
<li><a id="org0107506"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf146a66" class="outline-2">
<h2 id="orgf146a66">Week 15: FR Soundness</h2>
<div class="outline-text-2" id="text-orgf146a66">
</div>
<div id="outline-container-04-29" class="outline-3">
<h3 id="04-29">TUE 04-29 Lecture 25</h3>
<div class="outline-text-3" id="text-04-29">
</div>
<ul class="org-ul">
<li><a id="org2e2e7e0"></a>Title: <b>Progress and Preservation (Part 1)</b><br /></li>
<li><a id="org2bbb0cb"></a>Topics:<br /></li>
<li><a id="orgf326eda"></a>Reading:<br /></li>
<li><a id="orgdfc970e"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-05-01" class="outline-3">
<h3 id="05-01">TUE 05-01 Lecture 26</h3>
<div class="outline-text-3" id="text-05-01">
</div>
<ul class="org-ul">
<li><a id="org767f2ad"></a>Title: <b>Progress and Preservation (Part 2)</b><br /></li>
<li><a id="orgda44277"></a>Topics:<br /></li>
<li><a id="org8e751c8"></a>Reading:<br /></li>
<li><a id="orgbb34def"></a>Reminders:<br /></li>
</ul>
</div>
</div>
</div>
</body>
</html>
